Revit 2027 API
BuiltInFailures.StairRampFailures.CannotCreateRiser Property
 Can't create geometry for one or more risers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateRiser { get; }
Public Shared ReadOnly Property CannotCreateRiser As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateRiser {
	FailureDefinitionId^ get ();
}
static member CannotCreateRiser : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace